package 아지콩;

public class Main {

	public static void main(String[] args) {
	
		//인트로 길가다가 고양이를 만남 
		//선택 줍기 데려가기 입양ㅅㅎ사기
		//결론 데려감
		//고야잉 이름 무조건 아지 
		
		//아지 키우 스타트 
		//회원가입 창 
		//아이디 비번 치면 
		//controller통해 dao로 이동 dto는 정의 내려줌 
		
		//아지 그림 나오면서 0살 1개월 아가 고양이 사진 보내고 
		//기분은 랜덤으로 나오게 랜덤 이용
		//ex) 랜덤 나오면서 심심함 체력max 정도 표현 
		// 메뉴 같이 나오면서  선택 
		//사냥하기 
		//안에 미니 게임 넣기 숫자 세서 
		//실패시 꼬리 팡팡 
		//성공시 노근한 짤 
		//끝나면 체력과 친밀도 등등 스택 알려주기
		
		
		//배부름 row면 밥 주기 선택 
		// 밥 종류에 따라 친밀도만 변경 
		
		//친밀도 놀기로 쓰다듬기 등등 
		// 친밀도 향상 
		
		//지저분함 
		//목욕하기 하면 스트레스 max 
		
		//피곤함 
		//재우기  
		//스트레스 좀 낮아지고 체력 올라가고 등등 
		
		
		//한바퀴 돌면 끝! <로또 중복 숫자 안되게 하는거로 숫자 넣어서 넣기>
		
		
		
		
	}

}
